cool/tutorials/multiphase/interFoam/ras/damBreak/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform ( 0 0 0 0 0 0 );

boundaryField
{
    leftWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    rightWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           uniform ( 0 0 0 0 0 0 );
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 0 0 0 );
        value           uniform ( 0 0 0 0 0 0 );
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
